tap "brewforge/chinese"
tap "brewforge/extras"
tap "homebrew/bundle"
tap "homebrew/services"
brew "aom"
brew "apr"
brew "aqtinstall"
brew "ast-grep"
brew "bat"
brew "biome"
brew "btop"
brew "c-ares"
brew "libnghttp2"
brew "fmt"
brew "pkgconf"
brew "cabin"
brew "glib"
brew "libxcb"
brew "cairo"
brew "cargo-binstall"
brew "cmake"
brew "docker-compose"
brew "doxygen"
brew "dust"
brew "fastfetch"
brew "fd"
brew "fribidi"
brew "nettle"
brew "unbound"
brew "harfbuzz"
brew "libass"
brew "mbedtls"
brew "mpg123"
brew "libssh"
brew "pango"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-cliff"
brew "git-ignore"
brew "go"
brew "helix"
brew "hyperfine"
brew "kondo"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "libuv"
brew "lsd"
brew "node"
brew "mailsy"
brew "micromamba"
brew "nomino"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "ouch"
brew "oxipng"
brew "pandoc"
brew "pdfcpu"
brew "pnpm"
brew "postgresql@16"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "rustup"
brew "sd"
brew "sendme"
brew "serpl"
brew "sniffnet"
brew "starship"
brew "subversion"
brew "termscp"
brew "tex-fmt"
brew "the-way"
brew "tlrc"
brew "typst"
brew "typstyle"
brew "wthrr"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "brewforge/chinese/alist"
cask "android-studio"
cask "basictex-cn"
cask "bitwarden"
cask "cherry-studio"
cask "clash-nyanpasu"
cask "corretto@8"
cask "cryptomator"
cask "drawio"
cask "ecopaste"
cask "edrawmax@9"
cask "eshelper"
cask "espanso"
cask "flutter"
cask "font-fira-code-nerd-font"
cask "frhelper"
cask "google-chrome"
cask "gopeed"
cask "i4tools"
cask "inkscape-cn"
cask "jordanbaird-ice"
cask "julia-cn"
cask "keepingyouawake"
cask "localsend"
cask "lulu"
cask "lyricsx-mxiris"
cask "macfuse"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "navicat-premium-lite-cn"
cask "nutstore"
cask "obsidian"
cask "openmtp"
cask "orbstack"
cask "oversight"
cask "pdfsam-basic"
cask "pearcleaner"
cask "peazip"
cask "pot-desktop"
cask "qq"
cask "quickrecorder"
cask "shotcut"
cask "sigil"
cask "stretchly"
cask "tencent-meeting"
cask "tor-browser"
cask "upscayl"
cask "vibe"
cask "viber"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wireshark"
cask "wpsoffice-en"
cask "xnviewmp"
cask "zoom"
cask "zotero"
vscode "alefragnani.bookmarks"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "clover.md-table-editor"
vscode "cschlosser.doxdocgen"
vscode "czhang03.unicode-math-input"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "evertjunior.mass-renamer"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jock.svg"
vscode "jota0222.multi-formatter"
vscode "julialang.language-julia"
vscode "kirozen.wordcounter"
vscode "litchi.plt-snippet"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ltex-plus.vscode-ltex-plus"
vscode "marimo-team.vscode-marimo"
vscode "mathworks.language-matlab"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.live-server"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vivaxy.vscode-conventional-commits"
vscode "wangqvq.easy-pytorch"
vscode "xiaohuohumax.format-files-by-ignores"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zjffun.snippetsmanager"
