tap "brewforge/chinese"
tap "brewforge/extras"
brew "aom"
brew "bat"
brew "boost"
brew "bottom"
brew "glib"
brew "libxcb"
brew "cairo"
brew "eigen"
brew "openblas"
brew "suite-sparse"
brew "pkgconf"
brew "cmake"
brew "container"
brew "deno"
brew "dust"
brew "fastfetch"
brew "fd"
brew "sdl2"
brew "svt-av1"
brew "ffmpeg"
brew "fmt"
brew "fresh-editor"
brew "fribidi"
brew "fzf"
brew "gh"
brew "harfbuzz"
brew "tesseract"
brew "ghostscript"
brew "libnghttp2"
brew "nettle"
brew "unbound"
brew "go"
brew "graphviz"
brew "handbrake"
brew "hyperfine"
brew "imagemagick"
brew "lazygit"
brew "lsd"
brew "mas"
brew "micromamba"
brew "mise"
brew "mole"
brew "nlohmann-json"
brew "ollama", restart_service: :changed
brew "onefetch"
brew "onnx"
brew "qtbase"
brew "opencv"
brew "ouch"
brew "oxipng"
brew "pandoc"
brew "pdfcpu"
brew "poppler"
brew "postgresql@18"
brew "powershell", link: false
brew "ripgrep"
brew "ripgrep-all"
brew "ruff"
brew "scrcpy"
brew "sd"
brew "shfmt"
brew "starship"
brew "termscp"
brew "tex-fmt"
brew "tlrc"
brew "ty"
brew "typst"
brew "typstyle"
brew "uv"
brew "whisper-cpp"
brew "witr"
brew "wthrr"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "baidunetdisk"
cask "basictex"
cask "brewforge/chinese/blender@lts-cn"
cask "cap"
cask "brewforge/extras/cc-switch"
cask "cherry-studio"
cask "clash-verge-rev"
cask "brewforge/chinese/cockpit-tools"
cask "codex-app"
cask "cryptomator"
cask "dingtalk"
cask "drawio"
cask "brewforge/chinese/eshelper-cn"
cask "espanso"
cask "flying-carpet"
cask "brewforge/chinese/frhelper-cn"
cask "fuse-t"
cask "brewforge/chinese/gimp-cn"
cask "google-chrome"
cask "brewforge/extras/gopeed-app"
cask "brewforge/chinese/inkscape-cn"
cask "brewforge/chinese/julia-cn"
cask "keepingyouawake"
cask "linkandroid"
cask "localsend"
cask "lulu"
cask "mathpix-snipping-tool"
cask "brewforge/extras/media-downloader"
cask "microsoft-auto-update"
cask "microsoft-word"
cask "netlogo"
cask "nutstore"
cask "obsidian"
cask "brewforge/extras/pastemd"
cask "brewforge/extras/peazip"
cask "pot"
cask "powershell"
cask "qq"
cask "brewforge/chinese/qt-creator-cn"
cask "readest"
cask "brewforge/extras/rune-music"
cask "shotcut"
cask "sigil"
cask "stirling-pdf"
cask "teamviewer"
cask "tencent-meeting"
cask "tor-browser"
cask "vesktop"
cask "brewforge/extras/vibe"
cask "visual-studio-code"
cask "brewforge/chinese/vlc-cn"
cask "wechat"
cask "wechatwebdevtools"
cask "wechatwork"
cask "wezterm"
cask "wireshark-app"
cask "brewforge/extras/wpsoffice-en"
cask "xnviewmp"
cask "zoom"
cask "zotero"
mas "Microsoft To Do", id: 1274495053
mas "Xcode", id: 497799835
vscode "adachishingo.open-with"
vscode "alefragnani.bookmarks"
vscode "astral-sh.ty"
vscode "chanhx.crabviz"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "czhang03.unicode-math-input"
vscode "evertjunior.mass-renamer"
vscode "fluxlabs.gsd-2"
vscode "foam.foam-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.colab"
vscode "james-yu.latex-workshop"
vscode "kylinideteam.cmake-intellisence"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marimo-team.vscode-marimo"
vscode "marscode.marscode-extension"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "monosans.djlint"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "omarmujahid01.omars-comment-cleaner"
vscode "openai.chatgpt"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rvben.rumdl"
vscode "timonwong.shellcheck"
vscode "tombi-toml.tombi"
vscode "tomjs.vscode-snippets-manager"
vscode "tyngw.interactive-markdown-table-editor"
vscode "vincent-templier.vscode-netron"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "jupytext"
uv "kaggle"
uv "label-studio"
uv "pdf2ppt-converter"
uv "pdf2zh-next"
uv "touying"
uv "typ2docx"
