tap "brewforge/chinese"
tap "brewforge/extras"
brew "aom"
brew "aria2"
brew "ast-grep"
brew "bat"
brew "btop"
brew "c-ares"
brew "glib"
brew "libxcb"
brew "cairo"
brew "choose-rust"
brew "cmake"
brew "doxygen"
brew "dust"
brew "fastfetch"
brew "fd"
brew "fribidi"
brew "libnghttp2"
brew "nettle"
brew "unbound"
brew "harfbuzz"
brew "mbedtls"
brew "mpg123"
brew "libssh"
brew "pango"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fmt"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "hyperfine"
brew "identme"
brew "imagemagick"
brew "lazydocker"
brew "lazygit"
brew "libuv"
brew "lsd"
brew "node"
brew "mailsy"
brew "mas"
brew "micromamba"
brew "mysql"
brew "nomino"
brew "numbat"
brew "ollama", restart_service: :changed
brew "ouch"
brew "oxipng"
brew "pandoc"
brew "pdfcpu"
brew "pkgconf"
brew "podman"
brew "podman-compose"
brew "podman-tui"
brew "postgresql@17"
brew "ripgrep"
brew "ripgrep-all"
brew "rust"
brew "rustup"
brew "scrcpy"
brew "sd"
brew "serpl"
brew "sniffnet"
brew "starship"
brew "termscp"
brew "tex-fmt"
brew "tlrc"
brew "typst"
brew "typstyle"
brew "wthrr"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "android-commandlinetools"
cask "android-studio"
cask "basictex"
cask "bitwarden"
cask "cap"
cask "cherry-studio"
cask "clash-verge-rev"
cask "corretto@8"
cask "cryptomator"
cask "dbgate"
cask "ecopaste"
cask "eshelper-cn"
cask "espanso"
cask "flutter"
cask "flying-carpet"
cask "font-fira-code-nerd-font"
cask "frhelper-cn"
cask "fuse-t"
cask "geogebra"
cask "google-chrome"
cask "gopeed-app"
cask "handbrake-app"
cask "i4tools"
cask "inkscape-cn"
cask "jordanbaird-ice"
cask "julia-cn"
cask "keepingyouawake"
cask "linkandroid"
cask "localsend"
cask "lulu"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "nutstore"
cask "onlyoffice"
cask "pdfsam-basic"
cask "pearcleaner"
cask "peazip"
cask "podman-desktop"
cask "pot-desktop"
cask "powershell"
cask "pycharm"
cask "qq"
cask "qt-creator-cn"
cask "readest"
cask "rune-music"
cask "shotcut"
cask "sigil"
cask "tencent-meeting"
cask "tor-browser"
cask "vesktop"
cask "vibe"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wireshark-app"
cask "wpsoffice-en"
cask "xnviewmp"
cask "zoom"
cask "zotero"
mas "Microsoft To Do", id: 1274495053
mas "Xcode", id: 497799835
vscode "adachishingo.open-with"
vscode "alefragnani.bookmarks"
vscode "astral-sh.ty"
vscode "ban.spellright"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "chanhx.crabviz"
vscode "charliermarsh.ruff"
vscode "codeium.codeium"
vscode "cweijan.vscode-excel"
vscode "czhang03.unicode-math-input"
vscode "davidanson.vscode-markdownlint"
vscode "evertjunior.mass-renamer"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "golang.go"
vscode "gsgupta.opencv-snippets"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "marimo-team.vscode-marimo"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "pkief.material-icon-theme"
vscode "pomdtr.markdown-kroki"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rickaym.manim-sideview"
vscode "rust-lang.rust-analyzer"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomjs.vscode-snippets-manager"
vscode "ultralytics.ultralytics-snippets"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vincent-templier.vscode-netron"
vscode "yzhang.markdown-all-in-one"
