tap "brewforge/chinese"
tap "brewforge/extras"
tap "brewforge/games"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "aichat"
brew "gcc"
brew "openblas"
brew "armadillo"
brew "ast-grep"
brew "bat"
brew "biome"
brew "bottom"
brew "sqlite"
brew "glib"
brew "libxcb"
brew "cmake"
brew "croc"
brew "doxygen"
brew "dust"
brew "fastfetch"
brew "fd"
brew "nettle"
brew "unbound"
brew "ffmpeg"
brew "gitui"
brew "hyperfine"
brew "jq"
brew "kondo"
brew "lsd"
brew "monolith"
brew "neovim"
brew "node"
brew "ollama", restart_service: true
brew "onefetch"
brew "openjdk"
brew "ouch"
brew "pandoc"
brew "pdfcpu"
brew "pueue", restart_service: true
brew "qt"
brew "ripgrep"
brew "rustup-init"
brew "sd"
brew "starship"
brew "subversion"
brew "tealdeer"
brew "tectonic"
brew "tokei"
brew "typst"
brew "ugrep"
brew "xmake"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "brewforge/extras/typstyle"
cask "appcleaner"
cask "bitwarden"
cask "blackhole-2ch"
cask "buzz"
cask "capcut"
cask "clash-verge-rev"
cask "copyq"
cask "corretto-8"
cask "corsixth"
cask "crystalfetch"
cask "drawio"
cask "edrawmax-9"
cask "espanso"
cask "feige"
cask "font-fira-code-nerd-font"
cask "frhelper"
cask "gimp-cn"
cask "google-chrome"
cask "gopeed"
cask "i4tools"
cask "julia-cn"
cask "keepingyouawake"
cask "licecap"
cask "localsend"
cask "lulu"
cask "lyricsxjh"
cask "mambaforge-cn"
cask "mathpix-snipping-tool"
cask "noi"
cask "nutstore"
cask "obs-cn"
cask "openmtp"
cask "oversight"
cask "peazip"
cask "pot-desktop"
cask "qq"
cask "rectangle"
cask "squirrel-ime"
cask "tencent-meeting"
cask "tor-browser"
cask "utm"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wpsoffice"
cask "xnviewmp"
cask "zoom"
cask "zotero-beta"
vscode "affenwiesel.matlab-formatter"
vscode "alefragnani.bookmarks"
vscode "ast-grep.ast-grep-vscode"
vscode "biomejs.biome"
vscode "buuug7.gbk2utf8"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "clover.md-table-editor"
vscode "cschlosser.doxdocgen"
vscode "czhang03.unicode-math-input"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "hancel.google-translate"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "inu1255.easy-snippet"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jks-liu.wpls"
vscode "julialang.language-julia"
vscode "ksu-alt-cs.pedagogical"
vscode "mathworks.language-matlab"
vscode "mgt19937.typst-preview"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "qcz.text-power-tools"
vscode "rjmacarthy.twinny"
vscode "samubarb.vscode-doxyfile"
vscode "sharzyl.cjk-word-handler"
vscode "tamasfe.even-better-toml"
vscode "tboox.xmake-vscode"
vscode "tekumara.typos-vscode"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "yinfei.luahelper"
vscode "yutengjing.open-in-external-app"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zchrissirhcz.cmake-highlight"
