tap "brewforge/chinese"
tap "brewforge/extras"
tap "homebrew/bundle"
tap "homebrew/services"
brew "aom"
brew "apr"
brew "bat"
brew "biome"
brew "bottom"
brew "c-ares"
brew "glib"
brew "libxcb"
brew "chsrc"
brew "clipboard"
brew "cmake"
brew "doxygen"
brew "dust"
brew "eigen"
brew "fastfetch"
brew "fd"
brew "fribidi"
brew "libnghttp2"
brew "nettle"
brew "unbound"
brew "mbedtls"
brew "mpg123"
brew "libssh"
brew "sdl2"
brew "svt-av1"
brew "tesseract"
brew "ffmpeg"
brew "fmt"
brew "gh"
brew "gitui"
brew "graphviz2drawio"
brew "hyperfine"
brew "jq"
brew "kondo"
brew "libuv"
brew "lsd"
brew "node"
brew "mailsy"
brew "micromamba"
brew "nomino"
brew "ollama"
brew "onefetch"
brew "ouch"
brew "pandoc"
brew "pdfcpu"
brew "postgresql@16"
brew "pueue"
brew "qt"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup"
brew "sd"
brew "sniffnet"
brew "starship"
brew "subversion"
brew "tlrc"
brew "typst"
brew "typstyle"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "brewforge/extras/wthrr"
cask "basictex-cn"
cask "bitwarden"
cask "buzz"
cask "clash-verge-rev"
cask "copyq"
cask "corretto@8"
cask "crystalfetch"
cask "drawio"
cask "edrawmax@9"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "frhelper"
cask "geogebra"
cask "gimp@dev"
cask "google-chrome"
cask "gopeed"
cask "i4tools"
cask "inkscape-cn"
cask "jordanbaird-ice"
cask "julia-cn"
cask "keepingyouawake"
cask "localsend"
cask "lulu"
cask "lyricsx-mxiris"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "noi"
cask "nutstore"
cask "obsidian"
cask "openmtp"
cask "openrocket"
cask "orbstack"
cask "oversight"
cask "pearcleaner"
cask "peazip"
cask "pot-desktop"
cask "qq"
cask "qt-creator-cn"
cask "quickrecorder"
cask "shotcut"
cask "stretchly"
cask "tencent-meeting"
cask "ting-en"
cask "ting-es"
cask "tor-browser"
cask "utm"
cask "viber"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wpsoffice-installer"
cask "xnviewmp"
cask "zoom"
cask "zotero"
vscode "affenwiesel.matlab-formatter"
vscode "alefragnani.bookmarks"
vscode "alibaba-cloud.tongyi-lingma"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "charliermarsh.ruff"
vscode "cheshirekow.cmake-format"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "czhang03.unicode-math-input"
vscode "davidanson.vscode-markdownlint"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jks-liu.wpls"
vscode "jock.svg"
vscode "johnnymorganz.stylua"
vscode "julialang.language-julia"
vscode "kirozen.wordcounter"
vscode "leodevbro.blockman"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode.live-server"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-yaml"
vscode "samubarb.vscode-doxyfile"
vscode "sharzyl.cjk-word-handler"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zchrissirhcz.cmake-highlight"
vscode "zjffun.snippetsmanager"
