tap "brewforge/chinese"
tap "brewforge/extras"
tap "homebrew/bundle"
tap "homebrew/services"
brew "ast-grep"
brew "bat"
brew "biome"
brew "bottom"
brew "sqlite"
brew "glib"
brew "libxcb"
brew "chsrc"
brew "clang-format"
brew "cmake"
brew "doxygen"
brew "dust"
brew "eigen"
brew "envelope"
brew "fastfetch"
brew "fd"
brew "fribidi"
brew "nettle"
brew "unbound"
brew "tesseract"
brew "ffmpeg"
brew "gitui"
brew "go"
brew "openjdk"
brew "gradle"
brew "hyperfine"
brew "jq"
brew "kondo"
brew "libuv"
brew "lsd"
brew "mupdf"
brew "neovim"
brew "node"
brew "nomino"
brew "ollama", restart_service: true
brew "onefetch"
brew "ouch"
brew "pandoc"
brew "postgresql@16"
brew "pueue"
brew "qt"
brew "ripgrep"
brew "ripgrep-all"
brew "rustup-init"
brew "sd"
brew "sniffnet"
brew "starship"
brew "subversion"
brew "tlrc"
brew "tokei"
brew "typst"
brew "typstyle"
brew "xmake"
brew "yarn"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "brewforge/chinese/ollamaplist"
cask "android-studio"
cask "appcleaner"
cask "basictex-cn"
cask "bitwarden"
cask "clash-verge-rev"
cask "copyq"
cask "corretto@8"
cask "crystalfetch"
cask "drawio"
cask "edrawmax@9"
cask "espanso"
cask "font-fira-code-nerd-font"
cask "frhelper"
cask "gimp@dev"
cask "google-chrome"
cask "hammerspoon"
cask "i4tools"
cask "inkscape-cn"
cask "julia-cn"
cask "keepingyouawake"
cask "localsend"
cask "losslesscut"
cask "lulu"
cask "lyricsxjh"
cask "macwhisper"
cask "mambaforge-cn"
cask "mathpix-snipping-tool"
cask "motrix"
cask "noi"
cask "nutstore"
cask "obsidian"
cask "openmtp"
cask "orbstack"
cask "oversight"
cask "peazip"
cask "pot-desktop"
cask "qq"
cask "qt-creator-cn"
cask "quickrecorder"
cask "tencent-meeting"
cask "tor-browser"
cask "utm"
cask "viber"
cask "visual-studio-code"
cask "vlc-cn"
cask "wechat"
cask "wezterm"
cask "wpsoffice"
cask "xnviewmp"
cask "zoom"
cask "zotero@beta"
vscode "affenwiesel.matlab-formatter"
vscode "alefragnani.bookmarks"
vscode "biomejs.biome"
vscode "buuug7.gbk2utf8"
vscode "ccagml.vscode-leetcode-problem-rating"
vscode "charliermarsh.ruff"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "czhang03.unicode-math-input"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "franneck94.workspace-formatter"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "huacnlee.autocorrect"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jannisx11.batch-rename-extension"
vscode "jeronimoekerdt.color-picker-universal"
vscode "jks-liu.wpls"
vscode "jock.svg"
vscode "johnnymorganz.stylua"
vscode "julialang.language-julia"
vscode "kirozen.wordcounter"
vscode "leodevbro.blockman"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "mgt19937.typst-preview"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode.live-server"
vscode "myriad-dreamin.tinymist"
vscode "njpwerner.autodocstring"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qcz.text-power-tools"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "samubarb.vscode-doxyfile"
vscode "sharzyl.cjk-word-handler"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vivaxy.vscode-conventional-commits"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zchrissirhcz.cmake-highlight"
vscode "zjffun.snippetsmanager"
