[
  "obsidian-table-generator",
  "table-editor-obsidian",
  "obsidian-dictionary-plugin",
  "nldates-obsidian",
  "obsidian-pandoc",
  "obsidian-tasks-plugin",
  "obsidian-zotero-desktop-connector",
  "highlightr-plugin",
  "obsidian-excel-to-markdown-table",
  "obsidian-latex-suite",
  "omnisearch",
  "consistent-attachments-and-links",
  "notion-like-tables",
  "dbfolder",
  "obsidian-matrix",
  "emoji-shortcodes",
  "obsidian-git"
]