[
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "obsidian-tasks-plugin",
  "recent-files-obsidian",
  "obsidian-outliner",
  "obsidian-linter",
  "tldraw",
  "obsidian-plantuml",
  "obsidian-zotero-desktop-connector",
  "autocorrect-formatter",
  "obsidian-latex-suite",
  "omnisearch",
  "spellcheck-toggler",
  "various-complements",
  "pdf-plus",
  "obsidian-enhancing-export",
  "obsidian-full-calendar",
  "enhanced-symbols-prettifier"
]