[
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "obsidian-tasks-plugin",
  "calendar",
  "recent-files-obsidian",
  "obsidian-outliner",
  "obsidian-linter",
  "tldraw",
  "obsidian-plantuml",
  "obsidian-pandoc",
  "obsidian-zotero-desktop-connector",
  "autocorrect-formatter",
  "obsidian-latex-suite",
  "omnisearch",
  "spellcheck-toggler",
  "wypst",
  "various-complements",
  "pdf-plus"
]